def solution(h1, m1, s1, h2, m2, s2):
    
    st = h1 * 3600 + m1 * 60 + s1   # 시작 시간
    et = h2 * 3600 + m2 * 60 + s2   # 종료 시간
    
    # 분침과 초침의 상대 각속도: 360도/60s - 360도/3600s = 5.9/s -> 5.9t == 360k(k는 정수)일 때 겹침
    # 시침과 초침의 상대 각속도: 위와 같이 계산
    # 00:00:00과 12:00:00 지나는 경우 : 시/분/초침 모두 겹침 -> 제외
    cs = (st * 59) // 3600 + (st * 719) // 43200 - (2 if st >= 12 * 3600 else 1)    # 시작 시간까지 알람 횟수
    ce = (et * 59) // 3600 + (et * 719) // 43200 - (2 if et >= 12 * 3600 else 1)    # 종료 시간까지 알람 횟수
    
    answer = ce - cs
    
    # 시작 시점에 겹치는 경우 고려
    if (st * 59) % 3600 == 0 or (st * 719) % 43200 == 0:
        answer += 1
        
    return answer



